package com.example.formproject.enums;

import lombok.Getter;

import java.util.Arrays;

@Getter
public enum WeatherDescription {
    W200("천둥구름",200),W201("천둥구름",201),W202("천둥구름",202),W210("천둥구름",210),W211("천둥구름",211),W212("천둥구름",212),W221("천둥구름",221),
    W230("천둥구름",230),W231("천둥구름",231),W232("천둥구름",232),W300("안개비",300),W301("안개비",301),W302("강한 안개비",301),W310("적은비",310),
    W311("적은비",311),W312("적은비",312),W313("안개와 소나기",313),W314("안개와 소나기",314),W321("소나기",321),W500("악한 비",500),W501("중간 비",501),
    W502("강한 비",502),W503("매우 강한 비",503),W504("극심한 비",504),W511("우박",511),W520("약한 소나기",520),W521("소나기",521),
    W522("강한 소나기",522),W531("불규칙적 소나기",531),W600("가벼운 눈",600),W601("눈",600),W602("강한 눈",602),W611("진눈깨비",611),W612("진눈깨비",612),
    W615("약한 비와 눈",615),W616("비와 눈",616),W620("약한 눈",620),W621("눈",621),W622("강한 눈",622),W701("안개",701),W711("연기",711),
    W721("연무",721),W731("모래 먼지",731),W741("안개",741),W751("모래",751),W761("먼지",761),W762("화산재",762),W771("돌풍",771),
    W781("토네이도",781),W800("맑은 하늘",800),W801("구름 낀 하늘",801),W802("구름 낀 하늘",802),W803("맑은 하늘",803),
    W804("흐린 하늘",804),W900("토네이도",900),W901("태풍",901),W902("허리케인",902),W903("한랭",903),W904("고온",904),W905("바람부는",905),W906("우박",906),
    W951("미풍",951),W952("미풍",952),W953("약풍",953),W954("약풍",954),W955("선선한 바람",955),W956("강풍",956),W957("강풍",957),
    W958("돌풍",958),W959("돌풍",959),W960("폭풍",960),W961("강한 폭풍",961),W962("허리케인",962);

    private final String label;
    private final int number;

    WeatherDescription(String label, int number) {
        this.label = label;
        this.number = number;
    }

    public String label() {
        return label;
    }
    public int number() {
        return number;
    }

    public static WeatherDescription findByNumber(int number){
        return Arrays.stream(values()).filter(e->e.getNumber() == number).findFirst().orElse(WeatherDescription.W200);
    }
}
